import numpy as np

# Задание №1
# Даны значения величины заработной платы заемщиков банка (zp) и значения их поведенческого кредитного скоринга (ks):
# zp = [35, 45, 190, 200, 40, 70, 54, 150, 120, 110],
# ks = [401, 574, 874, 919, 459, 739, 653, 902, 746, 832].
# Найдите ковариацию этих двух величин с помощью элементарных действий, а затем с помощью функции cov из numpy
# Полученные значения должны быть равны.
# Найдите коэффициент корреляции Пирсона с помощью ковариации и среднеквадратичных отклонений двух признаков,
# а затем с использованием функций из библиотек numpy и pandas.

zp = [35, 45, 190, 200, 40, 70, 54, 150, 120, 110]
ks = [401, 574, 874, 919, 459, 739, 653, 902, 746, 832]
zp_mean = np.mean(zp)
ks_mean = np.mean(ks)
sigma_zp = np.std(zp, ddof=1)
sigma_ks = np.std(ks, ddof=1)

sum_cov = []
for n1, n2 in zip(zp, ks):
    sum_cov.append((n1 - zp_mean) * (n2 - ks_mean))
cov = sum(sum_cov) / (len(ks) - 1)
print(f'ковариация равняется {cov}')
# ковариация равняется 10175.377777777778
print(f'ковариация по функции равняется {np.cov(zp, ks)[1][0]}')
# ковариация по функции равняется 10175.377777777778

print(f'коэффициент корреляции Пирсона равняется {cov / (sigma_zp * sigma_ks)}')
# коэффициент корреляции Пирсона равняется 0.8874900920739162
print(f'коэффициент Пирсона по функции равняется {np.corrcoef(zp, ks)[1][0]}')
# коэффициент Пирсона по функции равняется 0.8874900920739164



# Задание №2
# Измерены значения IQ выборки студентов,
# обучающихся в местных технических вузах:
# 131, 125, 115, 122, 131, 115, 107, 99, 125, 111.
# Известно, что в генеральной совокупности IQ распределен нормально.
# Найдите доверительный интервал для математического ожидания с надежностью 0.95.

iq = [131, 125, 115, 122, 131, 115, 107, 99, 125, 111]
k_iq_mean = np.mean(iq)
std_ = np.std(iq, ddof=1)

# так как дисперсия гененральной совокупности неизвестна, то пользуемся Т-распределением.
upper = k_iq_mean + 2.262 * (std_/(len(iq) ** 0.5))
lower = k_iq_mean - 2.262 * (std_/(len(iq) ** 0.5))

print(f'доверительный интервал составляет {lower, upper}')
#доверительный интервал составляет (110.55660776308164, 125.64339223691834)

# Задание №3
# Известно, что рост футболистов в сборной распределен нормально
# с дисперсией генеральной совокупности, равной 25 кв.см. Объем выборки равен 27,
# среднее выборочное составляет 174.2. Найдите доверительный интервал для математического
# ожидания с надежностью 0.95.

# дисперсия гененральной сосовкупности составляет 25, значит используем Z-распределение.
upper_ = 174.2 + 1.96 * (5/(27 ** 0.5))
lower_ = 174.2 - 1.96 * (5/(27 ** 0.5))
print(f'доверительный интервал составляет {lower_, upper_}')
# доверительный интервал составляет (172.31398912064722, 176.08601087935276)
